create_clock -period 20.000 -name ref_clk -waveform {0.000 10.000} [get_ports ref_clk]
create_generated_clock -name mii_to_rmii_0_1/U0/rmii2mac_rx_clk -source [get_ports ref_clk] -divide_by 2 [get_pins mii_to_rmii_0_1/U0/rmii2mac_rx_clk_bi_reg/Q]
create_generated_clock -name mii_to_rmii_0_1/U0/rmii2mac_tx_clk -source [get_ports ref_clk] -divide_by 2 [get_pins mii_to_rmii_0_1/U0/rmii2mac_tx_clk_bi_reg/Q]
create_clock -period 40.000 -name VIRTUAL_mii_to_rmii_0_1/U0/rmii2mac_rx_clk -waveform {0.000 20.000}
set_input_delay -clock [get_clocks ref_clk] -min -add_delay 0.000 [get_ports i2c_*]
set_input_delay -clock [get_clocks ref_clk] -max -add_delay 6.000 [get_ports i2c_*]
set_input_delay -clock [get_clocks ref_clk] -min -add_delay 0.000 [get_ports {phy2rmii_rxd[*]}]
set_input_delay -clock [get_clocks ref_clk] -max -add_delay 6.000 [get_ports {phy2rmii_rxd[*]}]
set_input_delay -clock [get_clocks ref_clk] -min -add_delay 0.000 [get_ports phy2rmii_crs_dv]
set_input_delay -clock [get_clocks ref_clk] -max -add_delay 6.000 [get_ports phy2rmii_crs_dv]
set_input_delay -clock [get_clocks VIRTUAL_mii_to_rmii_0_1/U0/rmii2mac_rx_clk] -min -add_delay 0.000 [get_ports ext_rst_n]
set_input_delay -clock [get_clocks VIRTUAL_mii_to_rmii_0_1/U0/rmii2mac_rx_clk] -max -add_delay 6.000 [get_ports ext_rst_n]
set_input_delay -clock [get_clocks ref_clk] -min -add_delay 0.000 [get_ports ext_rst_n]
set_input_delay -clock [get_clocks ref_clk] -max -add_delay 6.000 [get_ports ext_rst_n]
create_clock -period 40.000 -name VIRTUAL_mii_to_rmii_0_1/U0/rmii2mac_tx_clk -waveform {0.000 20.000}
set_output_delay -clock [get_clocks ref_clk] -min -add_delay 0.000 [get_ports i2c_*]
set_output_delay -clock [get_clocks ref_clk] -max -add_delay 6.000 [get_ports i2c_*]
set_output_delay -clock [get_clocks ref_clk] -min -add_delay 0.000 [get_ports {rmii2phy_txd[*]}]
set_output_delay -clock [get_clocks ref_clk] -max -add_delay 6.000 [get_ports {rmii2phy_txd[*]}]
set_output_delay -clock [get_clocks VIRTUAL_mii_to_rmii_0_1/U0/rmii2mac_tx_clk] -min -add_delay 0.000 [get_ports led1]
set_output_delay -clock [get_clocks VIRTUAL_mii_to_rmii_0_1/U0/rmii2mac_tx_clk] -max -add_delay 6.000 [get_ports led1]
set_output_delay -clock [get_clocks ref_clk] -min -add_delay 0.000 [get_ports rmii2phy_tx_en]
set_output_delay -clock [get_clocks ref_clk] -max -add_delay 6.000 [get_ports rmii2phy_tx_en]

